Retrieves the description text of the failure.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2011
 Syntax
  C#
public string GetDescriptionText()
  Visual Basic
Public Function GetDescriptionText As String
  Visual C++
public:
String^ GetDescriptionText()
 Return Value
 The description text.
 See Also
  FailureMessage Class
  Autodesk.Revit.DB Namespace